import type { Role } from './types'

export type RoleKey =
  | '白板'
  | '执政官'
  | '狂热者'
  | '陆战队员'
  | '收割者'
  | '幽灵'
  | '感染虫'
  | 'SCV'
  | '阿巴瑟'
  | '工蜂'
  | '王虫'
  | '蟑螂'
  | '副官'
  | '追猎者'
  | '使徒'
  | '矿骡'
  | '斯台特曼'
  | '雷诺'
  | '阿塔尼斯'
  | '科学球'
  | '母舰核心'
  | '行星要塞'
  | '拟态虫'
  | '探机'
  | '泰凯斯'
  | '诺娃'
  | '思旺'
  | '跳虫'
  | '蒙斯克'
  | '雷神'
  | '机械哨兵'
  | '异龙'
  | '医疗兵'
  | '分裂池'
  | '响尾蛇'
  | '混合体'
  | '德哈卡'
  | '星港'
  | '进化腔'
  | '锻炉'
  | '扎加拉'
  | '大力神'
  | '凯瑞甘'
  | '凯瑞甘(异虫形态)'
  | '米拉'
  | '先知'
  | '阿尔达瑞斯'
  | '斯托科夫'
  | '解放者'
  | '解放者(防卫模式)'
  | '干扰者'

export const AllRole: RoleKey[] = [
  '白板',
  '执政官',
  '狂热者',
  '陆战队员',
  '收割者',
  '感染虫',
  'SCV',
  '阿巴瑟',
  '工蜂',
  '王虫',
  '蟑螂',
  '副官',
  '追猎者',
  '使徒',
  '矿骡',
  '斯台特曼',
  '雷诺',
  '阿塔尼斯',
  '科学球',
  '母舰核心',
  '行星要塞',
  '拟态虫',
  '探机',
  '泰凯斯',
  '诺娃',
  '思旺',
  '跳虫',
  '蒙斯克',
  '雷神',
  '机械哨兵',
  '异龙',
  '医疗兵',
  '分裂池',
  '响尾蛇',
  '混合体',
  '德哈卡',
  '星港',
  '进化腔',
  '锻炉',
  '扎加拉',
  '大力神',
  '凯瑞甘',
  '凯瑞甘(异虫形态)',
  '米拉',
  '先知',
  '阿尔达瑞斯',
  '斯托科夫',
  '解放者',
  '解放者(防卫模式)',
  '干扰者',
]

export const RoleData: Record<RoleKey, Role> = {
  白板: {
    name: '白板',
    pinyin: 'bb',
    ability: '魂姿',
    desc: '我乃江东小白板孙笨! 孙家天下孙家兵, 成就54320!',
  },
  执政官: {
    name: '执政官',
    pinyin: 'zzg',
    ability: '融合完成',
    desc: '每回合, 选择一张卡牌, 让它与右侧卡牌合成为一张卡牌, 两张卡牌必须非金色且为不同种族. 合并会保留两张卡牌的单位, 描述, 升级并变为金色卡牌.',
  },
  狂热者: {
    name: '狂热者',
    pinyin: 'krz',
    ability: '冲锋',
    desc: '你的所有单位在战斗时获得星空提速',
  },
  陆战队员: {
    name: '陆战队员',
    pinyin: 'lzdy',
    ability: '50块钱好兄弟',
    desc: '每回合, 花费2晶体矿发现一张低于酒馆等级1级的卡牌, 最低为1星卡牌',
  },
  收割者: {
    name: '收割者',
    pinyin: 'sgz',
    ability: '精准落地',
    desc: '你进场的所有卡牌都将定点部署, 而购买自带定点部署的卡牌只需要2晶体矿',
  },
  幽灵: {
    name: '幽灵',
    pinyin: 'yl',
    ability: '幽灵行动',
    desc: '可以切换为任意一种模式\n1隐身: 战斗阶段, 你的所有单位获得暗影战士升级\n2超级EMP: 战斗阶段, 你和敌方所有单位失去所有升级',
  },
  感染虫: {
    name: '感染虫',
    pinyin: 'grc',
    ability: '同化完成',
    desc: "每回合, 感染选中的人族卡牌. 该卡牌描述变为'无法三连, 每回合结束时注卵随机一个单位'",
  },
  SCV: {
    name: 'SCV',
    pinyin: 'S',
    ability: '快速施工',
    desc: '每回合, 修改选中人族卡牌的挂件类型',
  },
  阿巴瑟: {
    name: '阿巴瑟',
    pinyin: 'abs',
    ability: '突变',
    desc: '每回合, 花费2晶体矿, 摧毁选择的卡牌, 发现一张高一星的卡牌',
  },
  工蜂: {
    name: '工蜂',
    pinyin: 'gf',
    ability: '采集萃取',
    desc: '技术会和开始额外获得1点瓦斯, 偶数回合开始额外获得1晶体矿',
  },
  王虫: {
    name: '王虫',
    pinyin: 'wc',
    ability: '长程监视',
    desc: '你出售的单位会被添加到下一场战斗中, 并且出售的第一张卡牌兵力增加50%',
  },
  蟑螂: {
    name: '蟑螂',
    pinyin: 'zl',
    ability: '断智',
    desc: '启用技能后对战时, 单位生命值增加40%但无法操作(自动模式时增加30%)',
  },
  副官: {
    name: '副官',
    pinyin: 'fg',
    ability: '预备方案',
    desc: '你每回合的第一次刷新免费, 且本回合只要剩余晶体矿, 下回合获得1晶体矿',
  },
  追猎者: {
    name: '追猎者',
    pinyin: 'zlz',
    ability: '闪现',
    desc: '每回合第一次购买卡牌刷新酒馆, 1回合内刷新5次后升级次技能, 购买每张卡牌后刷新酒馆',
  },
  使徒: {
    name: '使徒',
    pinyin: 'st',
    ability: '白衣渡江',
    desc: '每回合购买的第三张卡牌费用为1(三连不计入其中)',
  },
  矿骡: {
    name: '矿骡',
    pinyin: 'kl',
    ability: '矿骡雨',
    desc: '使用技能重新补满晶体矿但下回合晶体矿将只有2点, 该技能无法连续使用',
  },
  斯台特曼: {
    name: '斯台特曼',
    pinyin: 'sttm',
    ability: '疯子科学家',
    desc: '任意卡牌进场都将发现随机三个升级中的一个, 但每回合不再会获得瓦斯, 而是升级酒馆等级获得1瓦斯',
  },
  雷诺: {
    name: '雷诺',
    pinyin: 'ln',
    ability: '我也是雷诺',
    desc: '使一张6星以下普通卡牌变为金色获得三连后的特效, 同时获得金光闪闪升级, 整局游戏只能使用一次',
  },
  阿塔尼斯: {
    name: '阿塔尼斯',
    pinyin: 'atns',
    ability: '集结部队',
    desc: '本局游戏中你的第9张神族卡牌进场后, 让阿塔尼斯与该卡牌合成',
  },
  科学球: {
    name: '科学球',
    pinyin: 'kxq',
    ability: '科学观察',
    desc: '任意卡牌进场时, 记录其中价值最高的单位\n每回合, 花费1瓦斯, 进场观察样本卡牌, 其中包含你所记录的所有单位. 每局游戏限两次',
  },
  母舰核心: {
    name: '母舰核心',
    pinyin: 'mjhx',
    ability: '审判从天而降',
    desc: '第一回合自动花费3晶体矿获得卡牌母舰核心, 玩家进行两次三连后, 母舰核心将变为母舰, 每次三连时, 该卡牌获得数量等于你酒馆等级的虚空辉光舰',
  },
  行星要塞: {
    name: '行星要塞',
    pinyin: 'xxys',
    ability: '城市化',
    desc: '每回合花费3晶体矿, 发现一张建筑卡\n所有建筑卡初始拥有的自动机炮数量等于当前酒馆等级+1',
  },
  拟态虫: {
    name: '拟态虫',
    pinyin: 'ntc',
    ability: '完全拟态',
    desc: '每回合, 花费2晶体矿为选中的卡牌添加单位, 从卡池中随机挑选一张当前酒馆等级的卡牌, 将其初始单位添加到选中卡牌\n无法连续为同一位置的卡牌添加',
  },
  探机: {
    name: '探机',
    pinyin: 'tj',
    ability: '野水晶',
    desc: '每回合, 花费1晶体矿将选中卡牌的1水晶塔变为虚空水晶塔\n任意卡牌进场时, 获得1水晶塔',
  },
  泰凯斯: {
    name: '泰凯斯',
    pinyin: 'tks',
    ability: '幕后交易',
    desc: '第一回合将自动花费3晶体矿获得卡牌不法之徒, 此卡牌会持续获得任务, 可以获得奥丁等奖励',
  },
  诺娃: {
    name: '诺娃',
    pinyin: 'nw',
    ability: '先进装备',
    desc: '每回合, 发现一张辅助卡, 若暂存区已满则无法获得',
  },
  思旺: {
    name: '思旺',
    pinyin: 'sw',
    ability: '回收',
    desc: '移除选中卡牌上的所有机械单位, 每移除一个, 卡牌机械工厂获得1零件\n场上没有工厂时, 自动尝试在空位上创建机械工厂',
  },
  跳虫: {
    name: '跳虫',
    pinyin: 'tc',
    ability: '同卵双狗',
    desc: '你的虫卵牌无法破卵孵化, 但拥有其他效果\n当你的酒馆等级达到4级时, 注卵会尝试创建第二个虫卵牌',
  },
  蒙斯克: {
    name: '蒙斯克',
    pinyin: 'msk',
    ability: '皇家卫队',
    desc: '花费9晶体矿, 将每张卡牌的1单位变为皇家单位\n可以变为皇家的单位优先级:\n战列巡航舰->雷神->攻城坦克->维京战机\n每回合开始时, 降低3点技能费用, 使用后重置费用',
  },
  雷神: {
    name: '雷神',
    pinyin: 'ls',
    ability: '切换模式',
    desc: '每级酒馆限一次: 为一张6星以下的卡牌选择新的描述, 并尝试令其触发进场特效\n(新描述必须是同星级, 同种族卡牌的描述, 且不包含拓展包卡牌; 卡牌三连后描述还原)',
  },
  机械哨兵: {
    name: '机械哨兵',
    pinyin: 'jxsb',
    ability: '幻象',
    desc: '每回合, 花费4晶体矿, 复制一张选中的低于5星的卡牌到暂存区, 最多使用3次',
  },
  异龙: {
    name: '异龙',
    pinyin: 'yl',
    ability: '组织再生',
    desc: '花费2晶体矿发现一张小于等于当前酒馆等级的虫族卡牌, 每级酒馆只能只用一次',
  },
  医疗兵: {
    name: '医疗兵',
    pinyin: 'ylb',
    ability: '战场急救',
    desc: '每回合, 摧毁选中的一张卡牌, 获得1晶体矿并将其中的生物单位平均分配给其他卡牌\n单位不包括英雄单位; 获得单位的卡牌不包括虫卵牌',
  },
  分裂池: {
    name: '分裂池',
    pinyin: 'flc',
    ability: '强制分裂',
    desc: '孵化效果能作用于非虫族卡牌\n每回合, 尝试令选中卡牌立即触发孵化效果',
  },
  响尾蛇: {
    name: '响尾蛇',
    pinyin: 'xws',
    ability: '挖宝奇兵',
    desc: '刷新3次发现一张当前酒馆等级的卡牌, 每级酒馆只能会用一次\n6星以下能4选1, 6星只能3选1',
  },
  混合体: {
    name: '混合体',
    pinyin: 'hht',
    ability: '究极生物',
    desc: '每回合结束时, 你每拥有两张星级相同, 种族分别为神族和虫族的卡牌时, 其中一张卡获得1对应星级的混合体\n各星级对应的混合体: (1)混合体掠夺者 (2)混合体天罚者 (3)混合体毁灭者 (4)混合体巨兽 (5)混合体支配者 (6)混合体实验体',
  },
  德哈卡: {
    name: '德哈卡',
    pinyin: 'dhk',
    ability: '精华采集者',
    desc: '选择非原始虫群卡牌时, 花费6精华, 将其变为原始刺蛇\n选择原始虫群卡牌时, 花费1精华, 为选择的卡牌进化1原始单位\n每回合开始时, 获得等于你瓦斯数量的精华',
  },
  星港: {
    name: '星港',
    pinyin: 'xg',
    ability: '绝对制空权',
    desc: '每回合开始时, 每张卡牌将n个地面单位变为怨灵战机(n=酒馆等级-1), 其中英雄单位变为战列巡航舰\n每回合结束时, 每张卡牌将1怨灵战机变为卡牌内价值最高的非英雄空中单位',
  },
  进化腔: {
    name: '进化腔',
    pinyin: 'jhq',
    ability: '升级方案',
    desc: '回合开始时, 发现一种突变\n突变(xA->xB): 每张虫族卡牌将x个单位A变为单位B',
  },
  锻炉: {
    name: '锻炉',
    pinyin: 'dl',
    ability: '升级攻防',
    desc: '每有1点数, 所有地面单位获得1%伤害和生命值加成\n每出售一张非虫卵牌, 获得2点数\n(点数不超过50)',
  },
  扎加拉: {
    name: '扎加拉',
    pinyin: 'zjl',
    ability: '生生不息',
    desc: '每回合开始时, 若你拥有至少6张卡牌, 尝试摧毁价值最高和最低的卡牌. 如果摧毁成功, 则获得11晶体矿',
  },
  大力神: {
    name: '大力神',
    pinyin: 'dls',
    ability: '快速部署',
    desc: '1. 游戏开始时, 挑选一张3星和5星的卡牌, 当酒馆等级提升到对应星级, 获得挑选的卡牌, 你的酒馆在升级3星和5星时升级费用+1.\n2. 每回合, 将选中卡牌与指定卡牌或空位交换位置.',
  },
  凯瑞甘: {
    name: '凯瑞甘',
    pinyin: 'krg',
    ability: '蓄势待发',
    desc: '升级酒馆后本回合内第一次刷新免费\n一回合内购买5张卡牌后变为异虫形态',
  },
  '凯瑞甘(异虫形态)': {
    name: '凯瑞甘(异虫形态)',
    pinyin: 'krg(ycxt)',
    ability: '赶尽杀绝',
    desc: '变身时瓦斯以及上限变为0, 同时每张卡牌获得自身的初始单位\n任意卡牌进场时, 发现一个三连升级',
    ext: true,
  },
  米拉: {
    name: '米拉',
    pinyin: 'ml',
    ability: '我全都要',
    desc: '进场的卡牌星级大于上一张进场卡牌时, 获得1晶体矿',
  },
  先知: {
    name: '先知',
    pinyin: 'xz',
    ability: '窥探命运',
    desc: '为选中卡牌发现1个三连升级, 每局游戏只能使用一次\n每回合第一次放弃升级时返回全部瓦斯, 你的卡牌升级上限+1',
  },
  阿尔达瑞斯: {
    name: '阿尔达瑞斯',
    pinyin: 'aedrs',
    ability: '静滞立场',
    desc: '当卡牌被锁定时, 下回合该卡牌的价格降为2晶体矿',
  },
  斯托科夫: {
    name: '斯托科夫',
    pinyin: 'stkf',
    ability: '神经感染',
    desc: '每回合, 花费0生命值刷新酒馆, 刷新出的卡牌都是当前酒馆等级的卡牌\n每升级一次酒馆, 技能消耗增加3点',
  },
  解放者: {
    name: '解放者',
    pinyin: 'jfz',
    ability: '战机模式',
    desc: '每回合, 奇数次刷新不耗费晶体矿, 但是购买卡牌需要4晶体矿\n使用技能, 变形为防卫模式, 每回合只能变形一次',
  },
  '解放者(防卫模式)': {
    name: '解放者(防卫模式)',
    pinyin: 'jfz(fwms)',
    ability: '防卫模式',
    desc: '商店无法刷新和补充卡牌, 但是购买卡牌只需要2晶体矿\n使用技能, 变形为战机模式, 每回合只能变形一次',
    ext: true,
  },
  干扰者: {
    name: '干扰者',
    pinyin: 'grz',
    ability: '净化新星',
    desc: '每回合开始时, 暂存区每有2张非辅助卡卡牌, 酒馆等级升级费用额外降低1',
  },
}
